# **Data Cleaning Assignment**

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are meant
to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
these missing numbers and make the column an integer column (instead of a float
column).

In [5]:
for i in range(df.FlightNumber.count() + 1):
    print(df.FlightNumber.loc[i,])
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1,] + 10
        print(df.FlightNumber.loc[i,])

10045.0
nan
10055.0
10065.0
nan
10075.0

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on
the underscore delimiter _ to give a new temporary DataFrame with the correct values.
Assign the correct column names to this temporary DataFrame.

In [7]:
df_tmp = df.copy()
df_tmp[['From','To']] = df_tmp.From_To.str.split("_",expand=True)
df_tmp

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN       10055.0  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis       10075.0  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this temporary
DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
"londON" should become "London"

In [9]:
df_tmp.From = df_tmp.From.str.capitalize()
df_tmp.To = df_tmp.To.str.capitalize()
df_tmp.From_To = df_tmp.From_To.str.capitalize()
df_tmp

            From_To  FlightNumber  ...      From         To
0      London_paris       10045.0  ...    London      Paris
1      Madrid_milan       10055.0  ...    Madrid      Milan
2  London_stockholm       10065.0  ...    London  Stockholm
3    Budapest_paris       10075.0  ...  Budapest      Paris
4   Brussels_london       10085.0  ...  Brussels     London

[5 rows x 6 columns]

4. Delete the From_To column from df and attach the temporary DataFrame from the
previous questions.

In [14]:
print(df)
print('*'*50)
df.drop('From_TO',axis=1,inplace=True)
print(df)
print('*'*50)
df['From_To'] = df_tmp['From_To']
print(df)

   FlightNumber  RecentDelays              Airline           From_TO
0       10045.0      [23, 47]               KLM(!)      London_paris
1       10055.0            []    <Air France> (12)      Madrid_milan
2       10065.0  [24, 43, 87]  (British Airways. )  London_stockholm
3       10075.0          [13]       12. Air France    Budapest_paris
4       10085.0      [67, 32]          "Swiss Air"   Brussels_london
**************************************************
   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"
**************************************************
   FlightNumber  RecentDelays              Airline           From_To
0       10045.0      [23, 47]               KLM(!)      London_paris
1       10055.0            []    <Air France> (12)      Madrid_milan
2       10065.0  [24, 43, 87]  (British Airways. )  London_stockholm
3       10075.0          [13]       12. Air France    Budapest_paris
4       10085.0      [67, 32]          "Swiss Air"   Brussels_london

5. In the RecentDelays column, the values have been entered into the DataFrame as a
list. We would like each first value in its own column, each second value in its own
column, and so on. If there isn't an Nth value, the value should be NaN.

In [15]:
rows = []
_ = df.apply(lambda row: [rows.append([row['Airline'], row['FlightNumber'],nn,row['From_To']]) 
                         for nn in row.RecentDelays], axis=1)
df_new = pd.DataFrame(rows, columns=df.columns)
print("New DataFrame :  \n")
print(df_new)

New DataFrame :

          FlightNumber  RecentDelays  Airline           From_To
0               KLM(!)       10045.0       23      London_paris
1               KLM(!)       10045.0       47      London_paris
2  (British Airways. )       10065.0       24  London_stockholm
3  (British Airways. )       10065.0       43  London_stockholm
4  (British Airways. )       10065.0       87  London_stockholm
5       12. Air France       10075.0       13    Budapest_paris
6          "Swiss Air"       10085.0       67   Brussels_london
7          "Swiss Air"       10085.0       32   Brussels_london

6.Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [16]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [18]:
length_cols=df3.shape[1]
col_list = []
col_dict ={}
for i in range(length_cols):
    Key = df3.columns[i]
    #print(key,i)
    Value = "Delay" + str(i+1)
    col_dict[Key] = Value
df3.rename(columns=col_dict,inplace=True)
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [19]:
df[["Delay1","Delay2","Delay3"]] = df3[["Delay1","Delay2","Delay3"]]
df.drop('RecentDelays',axis=1,inplace=True)
df

   FlightNumber              Airline           From_To  Delay1  Delay2  Delay3
0       10045.0               KLM(!)      London_paris    23.0    47.0     NaN
1       10055.0    <Air France> (12)      Madrid_milan     NaN     NaN     NaN
2       10065.0  (British Airways. )  London_stockholm    24.0    43.0    87.0
3       10075.0       12. Air France    Budapest_paris    13.0     NaN     NaN
4       10085.0          "Swiss Air"   Brussels_london    67.0    32.0     NaN